BEGIN;
INSERT INTO `descriptions` (`text`) VALUES
('# 黑龙江省民政厅关于同意七台河市设立兴北镇由新兴区划归茄子河区管辖的批复（黑民行批〔2022〕7号）

同意新兴区设立兴北镇，隶属关系由新兴区划归茄子河区管辖。镇人民政府驻北兴农场四委108栋362号。兴北镇的行政区划代码为230904102。

来源：[黑龙江省民政厅网站](https://mzt.hlj.gov.cn/mzt/c109882/202301/c00_31519178.shtml)'),
('# 江西省人民政府关于同意南昌市调整部分行政区划的批复（赣府字〔2022〕36号）

此件未公开发布。

# 关于南昌市新建区流湖镇划归南昌市红谷滩区管辖的公告

根据《南昌市人民政府关于我市部分行政区划调整的通知》（洪府字〔2022〕63号）精神，南昌市新建区流湖镇划归南昌市红谷滩区管辖。调整后，南昌市红谷滩区流湖镇行政区划代码为360113101。

来源：[红谷滩区人民政府网站](https://hgt.nc.gov.cn/hgtqrmzf/gggs/202208/75c6b6ddec784ab7b0fa661b80b1e411.shtml)'),
('# 豫民行批〔2022〕1号

此件未公开发布。

# 人民网领导留言板回复

2022年5月22日，航空港实验区管委会收到市委督查室《市委领导交办事项通知单》后，高度重视，立即安排组织人事和社会保障局对网民反映的问题进行核查。现将具体情况回复如下：

根据中共河南省委办公厅、河南省政府办公厅《关于放权赋能支持郑州加快国家中心城市建设的意见》精神，尉氏县岗李乡、大马乡行政区划转新郑市后，经济社会管理职能委托航空港区管理。

郑州市航空港区督察室
2022年5月32日

来源（链接已失效）：http://liuyan.people.com.cn/threads/content?tid=14795846'),
('# 兰州市人民政府关于变更城关区、安宁区、皋兰县部分行政区域界线的通告（兰政发〔2022〕15号）

根据《甘肃省人民政府关于同意兰州市变更城关区、安宁区、皋兰县部分行政区域界线的批复》（甘政发〔2022〕14号）精神，现将我市变更城关区、安宁区、皋兰县部分行政区域界线有关情况通告如下：

一、将皋兰县忠和镇的罗官村、忠和村、水源村3个建制村划入城关区，其中罗官村、忠和村2个建制村划入城关区盐场路街道管辖，水源村1个建制村划入城关区青白石街道管辖。

二、将皋兰县九合镇及其所辖全部11个建制村，忠和镇及其所辖的盐池社区1个社区和崖川村、丰登村、平岘村、六合村、盐池村5个建制村划入安宁区。变更后，忠和镇、九合镇政府驻地、名称不变。

特此通告。

兰州市人民政府
2022年4月22日

来源：[兰州市人民政府网站](https://www.lanzhou.gov.cn/art/2022/4/22/art_15333_1113677.html)'),
('# 自治区人民政府关于调整银川市贺兰县与金凤区局部行政区域界线的批复（宁政函〔2022〕31号）

银川市人民政府：

你市《关于调整贺兰县与金凤区局部行政区域界线的请示》（银政发〔2020〕37号）收悉，经自治区人民政府第119次常务会议研究，现批复如下：

一、同意将贺兰县北绕城高速路以南，第二农场渠向南延伸至唐徕渠与金凤区—贺兰县现行政区域界线交汇处以西，金凤区与贺兰县现行政区域界线以东区域调整变更至金凤区管辖。

二、调整后的行政区域界线按照金凤区人民政府与贺兰县人民政府共同勘定的界线执行，你市指导金凤区、贺兰县依法做好行政区域界线勘定、协议签订和调整区域内土地移交和管理工作，切实维护好法定界线的权威性和严肃性。

三、界线双方人民政府要指导本行政区域内企业、单位和界线附近群众，严格按照勘定的界线开展生产、生活等活动，确保界线附近地区安定团结和社会稳定。

宁夏回族自治区人民政府
2022年6月25日

来源：[宁夏回族自治区人民政府网站](https://www.nx.gov.cn/zwgk/qzfwj/202207/t20220704_3597747.html)'),
('# 四川省人民政府关于同意宜宾市部分县级行政区域界线变更的批复（川府民政〔2023〕1号）

宜宾市人民政府：

你市《关于高县沙河镇跳墩村整体划归珙县巡场镇的请示》（宜府〔2022〕79号）收悉。经研究，同意高县和珙县县级行政区域界线变更、将高县沙河镇跳墩村整体划转珙县巡场镇管辖。

上述行政区划调整涉及经费由你市自行解决。要严格落实党中央、国务院关于行政区划的决策部署，加强党对行政区划调整工作的领导，压实有关地方和部门责任，抓好调整方案和配套措施落实。行政区划调整完成后，要及时向省政府全面完整报告组织实施情况。

四川省人民政府
2023年4月28日

来源：[四川省民政厅网站](https://mzt.sc.gov.cn/scmzt/gsgg/2023/5/8/a127e13f97c3449db81c293c149970e2.shtml)'),
('# 昭通市人民政府关于昭阳区靖安镇划归大关县管辖的公告

根据省人民政府批复，昭阳区靖安镇划归大关县管辖，以原昭阳区靖安镇行政区域范围为大关县靖安镇行政区域范围，靖安镇人民政府驻洪家营村。大关县靖安镇行政区划代码为530624108000。

昭通市人民政府
2024年1月30日

来源：[昭通市人民政府网站](http://www.zt.gov.cn/lanmu/xwzx/contents/15/227164.html)'),
('# 关于批准撤销米林县设立县级米林市的公告

经党中央、国务院批准，撤销米林县，设立县级米林市，以原米林县的行政区域为米林市行政区域。米林市人民政府驻米林镇。米林市由西藏自治区直辖，林芝市代管。

西藏自治区人民政府
2023年4月3日

来源：[西藏自治区人民政府网站](https://www.xizang.gov.cn/zwgk/xxfb/gsgg_428/202304/t20230403_349021.html)'),
('# 关于批准撤销错那县设立县级错那市的公告

经党中央、国务院批准，撤销错那县，设立县级错那市，以原错那县的行政区域为错那市行政区域。错那市人民政府驻麻麻门巴民族乡。错那市由西藏自治区直辖，山南市代管。

西藏自治区人民政府
2023年4月3日

来源：[西藏自治区人民政府网站](https://www.xizang.gov.cn/zwgk/xxfb/gsgg_428/202304/t20230403_349035.html)'),
('# 兰州市人民政府关于变更永登县、皋兰县部分行政区域界线的通告

根据《甘肃省人民政府关于同意兰州市变更永登县、皋兰县部分行政区域界线的批复》（甘政发〔2023〕16号）精神，现将我市变更永登县、皋兰县部分行政区域界线有关事项通告如下：

将永登县秦川镇、中川镇2个建制镇和全部40个建制村、15个社区划入皋兰县，镇政府驻地、名称不变，继续由兰州新区托管。

特此通告。

兰州市人民政府
2023年6月5日

来源：[兰州新区网站](http://www.lzxq.gov.cn/system/2023/06/06/030791167.shtml)

# 兰州市人民政府关于永登县上川镇划入皋兰县行政区划的通告

根据《甘肃省人民政府关于同意兰州市永登县上川镇划入皋兰县行政区划的批复》（甘政函〔2023〕153号）精神，现将我市永登县上川镇划入皋兰县行政区划有关事项通告如下：

将永登县上川镇1个建制镇和所辖15个建制村划入皋兰县，继续委托兰州新区管理，上川镇人民政府驻地、名称不变。

特此通告。

兰州市人民政府
2023年12月27日

来源：[兰州政法网](https://www.lzzfw.gov.cn/Show/378170)'),
('# 新疆维吾尔自治区人民政府关于党中央、国务院批准设立县级白杨市的公告

党中央、国务院于近日批准，设立县级白杨市。白杨市人民政府驻光明路1号。白杨市由新疆维吾尔自治区直辖，管理方式按有关文件规定执行。

新疆维吾尔自治区人民政府
2023年1月20日

来源：[新疆维吾尔自治区人民政府网站](https://www.xinjiang.gov.cn/xinjiang/tzgg/202301/8bd4c6578fae4c469680d068c187c7b0.shtml)'),
('# 行政区划调整公告

近日，经自治区人民政府下发《关于同意喀什地区调整喀什市与疏附县疏勒县行政区划的批复》（新政函〔2024〕134号）同意疏附县疏勒县部分区域划入喀什市管辖。

喀什地区民政局
2024年7月24日

来源：[喀什地区行政公署网站](https://www.kashi.gov.cn/ksdqxzgs/c106694/202407/77d2ac785e6443cd85b49caa04e87e47.shtml)'),
('# 关于调整图木舒克市与克孜勒苏柯尔克孜自治州阿图什市、乌恰县行政区划的公告

党中央、国务院于近日批准，将克孜勒苏柯尔克孜自治州阿图什市、乌恰县部分行政区域划归图木舒克市管辖。

自治区民政厅  兵团民政局
2024年5月31日

来源：[新疆维吾尔自治区民政厅网站](https://mzt.xinjiang.gov.cn/xjmzt/c112990/202405/284c5498aeb44013ad189343f7f07080.shtml)'),
('# 关于调整铁门关市与巴音郭楞蒙古自治州和静县、焉耆回族自治县、博湖县、尉犁县、且末县行政区划的公告

党中央、国务院于近日批准，将巴音郭楞蒙古自治州和静县、焉耆回族自治县、博湖县、尉犁县、且末县部分行政区域划归铁门关市管辖。

自治区民政厅  兵团民政局
2024年5月31日

来源：[新疆维吾尔自治区民政厅网站](https://mzt.xinjiang.gov.cn/xjmzt/c112990/202405/834823359bbc4bd4babc103177464474.shtml)');
SET @id = LAST_INSERT_ID();

UPDATE `changes` SET `desc_id` = @id WHERE (`code`, `new_code`, `time`) = (230902, 230904, 2022);
UPDATE `changes` SET `desc_id` = @id := @id + 1 WHERE (`code`, `new_code`, `time`) = (360112, 360113, 2022);
UPDATE `changes` SET `desc_id` = @id := @id + 1 WHERE (`code`, `new_code`, `time`) = (410223, 410184, 2022);
SET @id = @id + 1;
UPDATE `changes` SET `desc_id` = @id WHERE (`code`, `new_code`, `time`) IN ((620122, 620102, 2022), (620122, 620105, 2022));
UPDATE `changes` SET `desc_id` = @id := @id + 1 WHERE (`code`, `new_code`, `time`) = (640122, 640106, 2022);
UPDATE `changes` SET `desc_id` = @id := @id + 1 WHERE (`code`, `new_code`, `time`) = (511525, 511526, 2023);
UPDATE `changes` SET `desc_id` = @id := @id + 1 WHERE (`code`, `new_code`, `time`) = (530602, 530624, 2023);
UPDATE `changes` SET `desc_id` = @id := @id + 1 WHERE (`code`, `new_code`, `time`) = (540422, 540481, 2023);
UPDATE `changes` SET `desc_id` = @id := @id + 1 WHERE (`code`, `new_code`, `time`) = (540530, 540581, 2023);
UPDATE `changes` SET `desc_id` = @id := @id + 1 WHERE (`code`, `new_code`, `time`) = (620121, 620122, 2023);
UPDATE `changes` SET `desc_id` = @id := @id + 1 WHERE (`code`, `new_code`, `time`) = (650000, 659012, 2023);
SET @id = @id + 1;
UPDATE `changes` SET `desc_id` = @id WHERE (`code`, `new_code`, `time`) IN ((653121, 653101, 2024), (653122, 653101, 2024));
SET @id = @id + 1;
UPDATE `changes` SET `desc_id` = @id WHERE (`code`, `new_code`, `time`) IN ((653001, 659003, 2024), (653024, 659003, 2024));
SET @id = @id + 1;
UPDATE `changes` SET `desc_id` = @id WHERE (`code`, `new_code`, `time`) IN ((652823, 659006, 2024), (652825, 659006, 2024), (652826, 659006, 2024), (652827, 659006, 2024), (652829, 659006, 2024));
COMMIT;
